src/DataProcessors/инкЗагрузкаКадровыхДанныхИзБПВЗИК/инкЗагрузкаКадровыхДанныхИзБПВЗИК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инкЗагрузкаКадровыхДанныхИзБПВЗИК</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/инкЗагрузкаКадровыхДанныхИзБПВЗИК/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Заголовок", "Укажите файл с данными: ");
	ПараметрыДиалога.Вставить("Фильтр", НСтр("ru = 'XML файлы (*.XML)'") + "|*.XML");
    
	Оповещение = Новый ОписаниеОповещения("ОткрытьОкноВыбораФайлаНаКлиентеЗавершение", ЭтотОбъект);
	ОбменДаннымиКлиент.ВыбратьИПередатьФайлНаСервер(Оповещение, ПараметрыДиалога, УникальныйИдентификатор);
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноВыбораФайлаНаКлиентеЗавершение(Знач РезультатПомещенияФайлов, Знач ДополнительныеПараметры) Экспорт
	
	АдресПомещенногоФайла = РезультатПомещенияФайлов.Хранение;
	ТекстОшибки           = РезультатПомещенияФайлов.ОписаниеОшибки;
	
	Если ПустаяСтрока(ТекстОшибки) И ПустаяСтрока(АдресПомещенногоФайла) Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка передачи файла настроек синхронизации данных на сервер'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
		
	// Успешно передали файл, загружаем на сервере.
    ИмяФайла = РезультатПомещенияФайлов.Имя; 
	//ЧастиИмени = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(РезультатПомещенияФайлов.Имя);
    
    Объект.АдресФайла = АдресПомещенногоФайла;
    Объект.ИмяФайла   = ИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	КлючеваяОперация = "Обработка.инкЗагрузкаКадровыхДанныхИзБПВЗИК.ЗагрузкаДанных";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
    ЗагрузитьДанныеНаСервере();
    
КонецПроцедуры    

&НаСервере
Процедура ЗагрузитьДанныеНаСервере()
    
    АдресФайла = Объект.АдресФайла;

    ВремКаталог =  КаталогВременныхФайлов();
    ПутьКФайлу = ВремКаталог + Новый УникальныйИдентификатор() + ".xml";
    
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
    ДвоичныеДанные.Записать(ПутьКФайлу);
    
    ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
    ОбработкаОбмена.ИмяФайлаОбмена = ПутьКФайлу;
    ОбработкаОбмена.РежимОбмена = "Загрузка";
    ОбработкаОбмена.ОткрытьФайлЗагрузки(Истина);
    ОбработкаОбмена.АрхивироватьФайл = Ложь;;
    ОбработкаОбмена.ВыполнитьЗагрузку();
    ОбработкаОбмена = Неопределено;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
